dec_test_app.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-17 Пн 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />



</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga2c1d52">приложение data_fetcher</a>
<ul>
<li><a href="#org3686ae3">веб-операция getAllCommunications</a>
<ul>
<li><a href="#org22d3d6d">конвертер GetAllCommunicationsApiRequest -&gt; DBSelectInput</a></li>
<li><a href="#orge4e9b3b">база Communication GetCommunications</a></li>
<li><a href="#orgcf0254f">(end) конвертер DBSelectOutput -&gt; GetAllCommunicationsApiResponse</a></li>
</ul>
</li>
<li><a href="#orgedd02f1">кафка-операция insertCommunications</a>
<ul>
<li><a href="#org6aeb663">конвертер InsertCommunicationsRequest -&gt; CommunicationAggregationInput</a></li>
<li><a href="#orga06fc27">агрегация</a></li>
</ul>
</li>
<li><a href="#orga678cf5">веб-операция sendNewClientId</a>
<ul>
<li><a href="#org0b9007d">конвертер SendNewClientIdApiRequest -&gt; GetNewIdWebClientInput</a></li>
<li><a href="#org89b02a3">веб-клиент MasterIdService GetNewId</a></li>
<li><a href="#org71ca9b2">конвертер GetNewIdWebClientOutput -&gt; SendNewIdToKafkaInput</a></li>
<li><a href="#orgba1e895">SendNewIdToKafka</a></li>
<li><a href="#org08f454b">(end) конвертер SendNewIdToKafkaOutput -&gt; SendNewClientIdApiResponse</a></li>
<li><a href="#org294622f">(end) GetNewIdWebClientError</a></li>
</ul>
</li>
<li><a href="#orgb5ad407">функции</a>
<ul>
<li><a href="#orgf94db0b">функция timestampToString</a></li>
<li><a href="#org7be3ce3">функция prepareInserts</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-orga2c1d52" class="outline-2">
<h2 id="orga2c1d52">приложение data_fetcher</h2>
<div class="outline-text-2" id="text-orga2c1d52">
<ul class="org-ul">
<li>contract_path: contract.yaml</li>
<li>entry: openapi</li>
<li>description: что-то делает</li>
<li>version: 0.0.1</li>
<li>url: dec_app</li>
</ul>
</div>

<div id="outline-container-org3686ae3" class="outline-3">
<h3 id="org3686ae3">веб-операция getAllCommunications</h3>
<div class="outline-text-3" id="text-org3686ae3">
</div>
<div id="outline-container-org22d3d6d" class="outline-4">
<h4 id="org22d3d6d">конвертер GetAllCommunicationsApiRequest -&gt; DBSelectInput</h4>
<div class="outline-text-4" id="text-org22d3d6d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">queryParams.userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>MDC: queryParams.user</li>
</ul>
</div>
</div>

<div id="outline-container-orge4e9b3b" class="outline-4">
<h4 id="orge4e9b3b">база Communication GetCommunications</h4>
<div class="outline-text-4" id="text-orge4e9b3b">
<ul class="org-ul">
<li>dbtype: postgres</li>
<li>strategy: all</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM communication WHERE user_id = :user_id
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf0254f" class="outline-4">
<h4 id="orgcf0254f">(end) конвертер DBSelectOutput -&gt; GetAllCommunicationsApiResponse</h4>
<div class="outline-text-4" id="text-orgcf0254f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rows[].id</td>
<td class="org-left">Long</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.communications[].id</td>
<td class="org-left">Long</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rows[].name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.communications[].name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rows[].status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.communications[].status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">rows[].time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.communications[].time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgedd02f1" class="outline-3">
<h3 id="orgedd02f1">кафка-операция insertCommunications</h3>
<div class="outline-text-3" id="text-orgedd02f1">
<ul class="org-ul">
<li>conusmer_type: json</li>
<li>topic_name: communication.input</li>
<li>auto_statup: true</li>
<li>retry: false</li>
</ul>
</div>
<div id="outline-container-org6aeb663" class="outline-4">
<h4 id="org6aeb663">конвертер InsertCommunicationsRequest -&gt; CommunicationAggregationInput</h4>
<div class="outline-text-4" id="text-org6aeb663">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">communications[].name</td>
<td class="org-left">String</td>
<td class="org-left">prepareInserts</td>
<td class="org-left">inserts[].name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">communications[].status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">inserts[].status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">communications[].time</td>
<td class="org-left">Instant</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">inserts[].time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>MDC: userId:userId</li>
</ul>
</div>
</div>

<div id="outline-container-orga06fc27" class="outline-4">
<h4 id="orga06fc27">агрегация</h4>
<div class="outline-text-4" id="text-orga06fc27">
</div>
<ul class="org-ul">
<li><a id="org9362724"></a>ветка<br />
<div class="outline-text-5" id="text-org9362724">
<ul class="org-ul">
<li>foreach: insert in communicationInput.inserts</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org57b1d8a"></a>конвертер AggregationBranchInput -&gt; insertCommunicationInput<br />
<div class="outline-text-6" id="text-org57b1d8a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">aggregationBranch.userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insert.name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insert.status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">insert.time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="orgd0d2e9c"></a>база Communication InsertCommunication<br />
<div class="outline-text-6" id="text-orgd0d2e9c">
<ul class="org-ul">
<li>dbtype: postgres</li>
<li>procedure: sandbox.insert_user_communication</li>
</ul>
</div>
</li>

<li><a id="orgbb1b11a"></a>(end) конвертер InsertCommunicationOutput -&gt; AggregationBranchOutput<br />
<div class="outline-text-6" id="text-orgbb1b11a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">id</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>MDC:</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga678cf5" class="outline-3">
<h3 id="orga678cf5">веб-операция sendNewClientId</h3>
<div class="outline-text-3" id="text-orga678cf5">
</div>
<div id="outline-container-org0b9007d" class="outline-4">
<h4 id="org0b9007d">конвертер SendNewClientIdApiRequest -&gt; GetNewIdWebClientInput</h4>
<div class="outline-text-4" id="text-org0b9007d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bodyParam.userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bodyParam.userIdType</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">bodyParam.userIdType</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>MDC: bodyParam.use</li>
</ul>
</div>
</div>

<div id="outline-container-org89b02a3" class="outline-4">
<h4 id="org89b02a3">веб-клиент MasterIdService GetNewId</h4>
<div class="outline-text-4" id="text-org89b02a3">
<ul class="org-ul">
<li>method: POST</li>
<li>uri: /new_id</li>
<li>webclient_contract_path: masterIdService/contract.yaml</li>
<li>config_properties_prefix: rest.master-id-service</li>
<li>exceptions: GetNewIdWebClientErrorException</li>
<li id="getNewIdWebClientErrorException">ошибка GetNewIdWebClientError</li>
</ul>
</div>
</div>

<div id="outline-container-org71ca9b2" class="outline-4">
<h4 id="org71ca9b2">конвертер GetNewIdWebClientOutput -&gt; SendNewIdToKafkaInput</h4>
<div class="outline-text-4" id="text-org71ca9b2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bodyParam.newUserId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">newUserId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GetNewIdWebClientInput/bodyParam.userId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">oldUserId</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgba1e895" class="outline-4">
<h4 id="orgba1e895">SendNewIdToKafka</h4>
<div class="outline-text-4" id="text-orgba1e895">
<ul class="org-ul">
<li>producer_type: json</li>
<li>topic_name: user.id.input</li>
<li>auto_statup: true</li>
</ul>
</div>
</div>

<div id="outline-container-org08f454b" class="outline-4">
<h4 id="org08f454b">(end) конвертер SendNewIdToKafkaOutput -&gt; SendNewClientIdApiResponse</h4>
<div class="outline-text-4" id="text-org08f454b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org294622f" class="outline-4">
<h4 id="org294622f">(end) GetNewIdWebClientError</h4>
<div class="outline-text-4" id="text-org294622f">
<ul class="org-ul">
<li>code: 400</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">userError = "Возникла ошибка при обращении к MasterIdService"</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb5ad407" class="outline-3">
<h3 id="orgb5ad407">функции</h3>
<div class="outline-text-3" id="text-orgb5ad407">
</div>
<div id="outline-container-orgf94db0b" class="outline-4">
<h4 id="orgf94db0b">функция timestampToString</h4>
<div class="outline-text-4" id="text-orgf94db0b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">time</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-java">public static TimestampToStringOutput timestampToString(TimestampToStringInput input) {
    TimestampToStringOutput output = new TimestampToStringOutput(input.getTime().toString());
    return output;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7be3ce3" class="outline-4">
<h4 id="org7be3ce3">функция prepareInserts</h4>
<div class="outline-text-4" id="text-org7be3ce3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input Name</th>
<th scope="col" class="org-left">Input Type</th>
<th scope="col" class="org-left">-&gt;</th>
<th scope="col" class="org-left">Output Name</th>
<th scope="col" class="org-left">Output Type</th>
<th scope="col" class="org-left">Описание</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">time</td>
<td class="org-left">Timestamp</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">name</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">status</td>
<td class="org-left">String</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-java">public static PrepareInsertsOutput prepareInserts(PrepareInsertsInput input) {
    PrepareInsertsOutput output = new PrepareInsertsOutput();
    output.setName(input.getName());
    output.setStatus(input.getStatus());
    output.setTime(Timestamp.from(input.getTime()));
    return output;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-06-17 Пн 00:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
